app/views/questions/_question.html.erb

   <div class="questioned">
 <%= link_to "回答#{question.answers.count}件", question_path(question) %>
---
SELECT COUNT(*) FROM `answers` WHERE `answers`.`question_id` = 1