app/views/questions/show.html.erb

    </div>
    <% if @question.answers.present? %>
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 3