app/views/groups/show.html.erb

    <div class="list-group">
    <% @group.users.each do |user| %>
---
SELECT `users`.* FROM `users` WHERE `users`.`group_id` = 1