app/views/answers/_answer.html.erb

    </div>
    <% if answer.question.answers.count > 1 %>
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `answers` WHERE `answers`.`question_id` = 2