app/controllers/answers_controller.rb

  def new
    @question = Question.find(params[:question_id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

 def create
    @answer = Answer.create(create_params)
---
INSERT INTO `answers` (`question_id`, `user_id`, `text`, `created_at`, `updated_at`) VALUES (1, 4, '100mm*30mm', '2020-06-08 08:55:30', '2020-06-08 08:55:30')

 def edit
    @answer = Answer.find(params[:id])
---
SELECT  `answers`.* FROM `answers` WHERE `answers`.`id` = 2 LIMIT 1

  def update
    answer = Answer.find(params[:id])
---
SELECT  `answers`.* FROM `answers` WHERE `answers`.`id` = 2 LIMIT 1