app/controllers/groups_controller.rb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def show
    @group = Group.find(params[:id])