app/controllers/questions_controller.rb

  def create
    Question.create(create_params)
---
INSERT INTO `questions` (`user_id`, `text`, `group_id`, `created_at`, `updated_at`) VALUES (4, 'アグリコラのスリーブってどれくらい？', 1, '2020-06-08 08:53:22', '2020-06-08 08:53:22')

 def show
    @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1