app/controllers/users_controller.rb

  def update
    current_user.update(update_params)
---
UPDATE `users` SET `favorite_game` = '人生ゲーム', `updated_at` = '2020-06-12 02:24:37' WHERE `users`.`id` = 4