app/models/answer.rb

INSERT INTO `feed_contents` (`group_id`, `created_at`, `updated_at`) VALUES (1, '2020-06-12 07:45:00', '2020-06-12 07:45:00')
---
  def create_feed_content
    self.feed_content = FeedContent.create(group_id: question.group_id, updated_at: updated_at)