app/models/question.rb

INSERT INTO `feed_contents` (`group_id`, `created_at`, `updated_at`) VALUES (1, '2020-06-08 09:35:25', '2020-06-08 09:35:25')
---
  def create_feed_content
    self.feed_content = FeedContent.create(group_id: group_id, updated_at: updated_at)