app/models/user.rb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`key` = 'G-link' ORDER BY `groups`.`id` ASC LIMIT 1
---
  def self.find_first_by_auth_conditions(warden_conditions)
    conditions = warden_conditions.dup
    group_key = conditions.delete(:group_key)
    group_id = Group.where(key: group_key).first

INSERT INTO `groups` (`key`, `created_at`, `updated_at`) VALUES ('G-link', '2020-06-08 07:10:54', '2020-06-08 07:10:54')
SELECT  `groups`.* FROM `groups` WHERE `groups`.`key` = 'G-link' ORDER BY `groups`.`id` ASC LIMIT 1
---
  def group_key_to_id
    group = Group.where(key: group_key).first_or_create