app/views/common/_header.html.erb

            <ul class="dropdown-menu" role="menu">
              <li><%= link_to current_user.group.key, group_path(current_user.group) %></li>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1